Examinator/src/DataProcessors/НастройкаХраненияФайловВидеоСУЗ/НастройкаХраненияФайловВидеоСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НастройкаХраненияФайловВидеоСУЗ</name>
</mdclass:DataProcessor>

Examinator/src/InformationRegisters/ДанныеФайлыСУЗ/ДанныеФайлыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеФайлыСУЗ</name>
  <resources>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗПрисоединенныеФайлы</types>
    </type>
  </resources>
  <resources>
    <name>ТекстовыеДанные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДвоичныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/DataProcessors/НастройкаХраненияФайловВидеоСУЗ/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОтказатьсяОтРазмещенияФайловВТомах(Команда)
	ОтказатьсяОтРазмещенияФайловВТомахНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиФайлыВТома(Команда)
	ПодготовитьФайлыКРазмещениюВТомахНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПодготовитьФайлыКРазмещениюВТомахНаСервере()
		
	ВыборкаДетальныеЗаписи = РегистрыСведений.ДанныеФайлыСУЗ.ДанныеФайловДляРазмещенияВБСП();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			МенеджерЗаписи = РегистрыСведений.ДанныеФайлыСУЗ.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.СсылкаНаОбъектСУЗ = ВыборкаДетальныеЗаписи.СсылкаНаЭлементКурса;
			МенеджерЗаписи.Поставщик = ВыборкаДетальныеЗаписи.Поставщик;
			МенеджерЗаписи.Версия = ВыборкаДетальныеЗаписи.Версия; 
			МенеджерЗаписи.КодДанных = ВыборкаДетальныеЗаписи.КодДанных;
			
			МенеджерЗаписи.Прочитать();
			
			Если НЕ МенеджерЗаписи.Выбран() Тогда
				ВызватьИсключение НСтр("ru = 'Ошибка чтения данных элемента курса'");
			КонецЕсли;		
			
			ДвоичныеДанные = МенеджерЗаписи.ДвоичныеДанные.Получить();
			
			Если ДвоичныеДанные <> Неопределено Тогда			
							
				СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ВыборкаДетальныеЗаписи.ИмяФайла, Ложь);
				РасширениеБезТочки = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(СтруктураИмениФайла.Расширение);
				
				ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьФайл(ВыборкаДетальныеЗаписи.СсылкаНаЭлементКурса, СтруктураИмениФайла.ИмяБезРасширения, РасширениеБезТочки, ВыборкаДетальныеЗаписи.ДатаИзменения, ВыборкаДетальныеЗаписи.ДатаИзменения, ПоместитьВоВременноеХранилище(ДвоичныеДанные));			
					
				МенеджерЗаписи.ДвоичныеДанные = Неопределено;
				МенеджерЗаписи.ПрисоединенныйФайл = ПрисоединенныйФайл;
				
				МенеджерЗаписи.Записать(Истина);
				
			Иначе
				
				МенеджерЗаписи = Неопределено;
				
			КонецЕсли;

			
			ЗафиксироватьТранзакцию();
		
		Исключение
		
		 	ОтменитьТранзакцию();
			УстановитьВидимостьЭлементовФормы();
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОтказатьсяОтРазмещенияФайловВТомахНаСервере()
			
	ВыборкаДетальныеЗаписи = РегистрыСведений.ДанныеФайлыСУЗ.ДанныеФайловРазмещенныеВБСП();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			МенеджерЗаписи = РегистрыСведений.ДанныеФайлыСУЗ.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.СсылкаНаОбъектСУЗ = ВыборкаДетальныеЗаписи.СсылкаНаЭлементКурса;
			МенеджерЗаписи.Поставщик = ВыборкаДетальныеЗаписи.Поставщик;
			МенеджерЗаписи.Версия = ВыборкаДетальныеЗаписи.Версия; 
			МенеджерЗаписи.КодДанных = ВыборкаДетальныеЗаписи.КодДанных;
			
			МенеджерЗаписи.Прочитать();
			
			Если НЕ МенеджерЗаписи.Выбран() Тогда
				ВызватьИсключение НСтр("ru = 'Ошибка чтения данных элемента курса'");
			КонецЕсли;		
			
			ПрисоединенныйФайл = МенеджерЗаписи.ПрисоединенныйФайл;
			
			ФайлСуществует = Истина;
			ОписаниеОшибкиФайла = "";
			
			Попытка
				ДвоичныеДанные = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ПрисоединенныйФайл);
			Исключение
				ФайлСуществует = Ложь;
				ОписаниеОшибкиФайла = ОписаниеОшибки();
			КонецПопытки;
			
			Если ФайлСуществует И ДвоичныеДанные <> Неопределено Тогда				
				МенеджерЗаписи.ДвоичныеДанные = Новый ХранилищеЗначения(ДвоичныеДанные);
			Иначе				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибкиФайла);				
			КонецЕсли;
			
			МенеджерЗаписи.ПрисоединенныйФайл = Неопределено;				
			МенеджерЗаписи.Записать(Истина);
			
			ПрисоединенныйФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
			ПрисоединенныйФайлОбъект.УстановитьПометкуУдаления(Истина);
			
			ЗафиксироватьТранзакцию();
		
		Исключение
		
		 	ОтменитьТранзакцию();
			УстановитьВидимостьЭлементовФормы();
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	УстановитьВидимостьЭлементовФормы();
	
	// Удаляем файлы, на которых нет ссылок
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыСУЗПрисоединенныеФайлы.Ссылка
		|ИЗ
		|	Справочник.ФайлыСУЗПрисоединенныеФайлы КАК ФайлыСУЗПрисоединенныеФайлы
		|ГДЕ
		|	ФайлыСУЗПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПрисоединенныйФайлОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ПрисоединенныйФайлОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;

	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
				
	ТребуетсяНастройкаТомов = Неопределено;
	ТребуетсяПереносВТома = Неопределено;
	ТребуетсяОтказатьсяОтТомов = Неопределено;
	НастройкаНеТребуется = Неопределено;
	
	Обработки.НастройкаХраненияФайловВидеоСУЗ.СостояниеНастройки(ТребуетсяНастройкаТомов, ТребуетсяПереносВТома, ТребуетсяОтказатьсяОтТомов, НастройкаНеТребуется); 
	
	Элементы.ГруппаТребуетсяНастройкаТомов.Видимость = ТребуетсяНастройкаТомов;
	Элементы.ГруппаПереносВТома.Видимость = ТребуетсяПереносВТома;
	Элементы.ГруппаОтказатьсяОтТомов.Видимость = ТребуетсяОтказатьсяОтТомов;
	Элементы.ГруппаНастройкаНеТребуется.Видимость = НастройкаНеТребуется;
		
КонецПроцедуры


#КонецОбласти
